examples/four_turbines/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "ASLparameters"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
	type			atmBoundaryLayerInletK;
	#include                "ASLparameters"
    }

    ground
    {
        type            kqRWallFunction;
        value           $turbulentKE;
    }

    top
    {
        type            fixedValue;
        value    uniform $turbulentKE;
    }

    #include "sidePatches"
}

// ************************************************************************* //
